package NetCoding.Basic_Coding;

public class Introduce {
    public static void main(String[] args) {
        //  网络编程

        //  在网络通信协议下,不同计算机上运行的程序,进行的数据传输
        //  即时通信,网游对战,邮件.....
        //  不管是什么场景,都是计算机跟计算机之间通过网络进行数据传输
        //  java中可以使用 java.net 包下的技术轻松开发出常见的网络应用程序      BS  和  CS

        //  Cs
        //  ClientDemo / ServerDemo         客户端 / 服务器
        //  在用户本地需要下载并安装客户端程序,在远程有一个服务器端程序
        //  画面可以做的非常精美,用户体验好
        //  需要开发 客户端 和 服务端
        //  用户需要 下载 和 更新 的时候太麻烦

        //  Bs
        //  Browser / ServerDemo        浏览器 / 服务器
        //  只需要一个浏览器,用户通过不同的网址,客户访问不同的服务器
        //  不需要开发客户端,只需要页面 + 服务端
        //  用户不需要下载,打开浏览器就能使用
        //  如果应用过大,可能会影响体验

    }
}
